snlkuharlocal/src/Documents/Претензия/Претензия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Претензия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТМЦКомиссия</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерАкта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительныеДокументы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОВызовеПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяНакладная</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияТовара</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВскрытияТары</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсх</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/СостоянияПретензий/СостоянияПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПретензий</name>
  <resources>
    <name>СостояниеПретензии</name>
    <type>
      <types>EnumRef.СостояниеПретензии</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Претензия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостояниеПретензии/СостояниеПретензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеПретензии</name>
  <enumValues>
    <name>Оформлена</name>
  </enumValues>
  <enumValues>
    <name>ПереданаМенеджеру</name>
  </enumValues>
  <enumValues>
    <name>ПереданаПО</name>
  </enumValues>
  <enumValues>
    <name>ОтправленаКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Претензия/ObjectModule.bsl
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14
Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		//Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокОснование.Метаданные().Имя="Перемещение" И ДокОснование.Склад.КодФизическогоУзла<>ПараметрыСеанса.ЭтотУзел.Код Тогда
		//	СообщитьОбОшибке("Рекламационные накладные на перемещения вводятся только на складе отправителе !!!");
		//	Отказ=Истина;
		//КонецЕсли;
		
		//крохин начало 26.09.2012
		Если НЕ ПолучитьПолномочиеПользователя("РаботаСПретензиями") Тогда
			Отказ = Истина;
		КонецЕсли;
		//крохин конец 26.09.2012
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;	         
	
	
	// Кухарь А.Ю.  31.03.2026 начало 
	//OUT-204
	если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") тогда      
		ДатаДокОснования = ПолучитьРеквизитШапки(ДокОснование,"Дата","Документ");
		если ЗначениеЗаполнено(ДатаДокОснования) и ДатаДокОснования+1 <> Дата тогда    
			Дата = ДатаДокОснования + 1;
		КонецЕсли;
	КонецЕсли;
	// Кухарь А.Ю.  31.03.2026 конец
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Отработано=Ложь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Подразделение   = Контрагент.Менеджер.Подразделение;
	
	ВалютаДокумента=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	
	ДвиженияПоРегистрам=Неопределено;	
	
	Если ПолучитьСостояниеПретензии(Ссылка) = Перечисления.СостояниеПретензии.Закрыта И НЕ ПризнакВозврата Тогда
		//крохин начало 07.11.2012
		//Возврат;
		//5 претензий делают движений, ошибка + закрытый период
		Если Дата >= '20121101' ИЛИ (Номер <> "ODN-001526" И Номер <> "ODN-001527" И Номер <> "ODN-001528" И Номер <> "ODN-001529" И Номер <> "ODN-001538" ) Тогда
			Возврат;
		КонецЕсли;
		//крохин конец 07.11.2012
	КонецЕсли;
	//взаиморасчеты
	ДвиженияПоВзаиморасчетам=Неопределено;
	РезультатПроведения=ПроведениеПоРегистрамВзаиморасчетов(Ссылка,ДвиженияПоВзаиморасчетам);
	Если ПризнакВозврата Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДвиженияПоВзаиморасчетам.взаиморасчеты Цикл
			СтрокаТЧ.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаТЧ.СуммаДокумента = - СтрокаТЧ.СуммаДокумента;
			СтрокаТЧ.СуммаВал = -СтрокаТЧ.СуммаВал;
			СтрокаТЧ.СуммаУпр = - СтрокаТЧ.СуммаУпр;
		КонецЦикла;
	КонецЕсли;
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоВзаиморасчетам,ОбменДанными.Загрузка);
	
	//крохин начало 10.12.2020
	//крохин начало 06.04.2021
	//проводки только в ЦО
	//Если ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		//крохин конец 06.04.2021
		ДвиженияПоОстаткамТМЦ=Неопределено;
		//крохин начало 29.03.2021
		//опечатка
		//РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоВзаиморасчетам);
		РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоОстаткамТМЦ);
		//крохин конец 29.03.2021
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦ,ОбменДанными.Загрузка);
	КонецЕсли;	
	//крохин конец 10.12.2020
	
	
	//ЗАТРАТЫ
	Движение=Движения.Затраты.Добавить();
	
	Движение.Период			= Дата;
	//крохин начало 02.04.2012
	//для ПНК движения обратные
	//Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	Если ПризнакВозврата Тогда
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	КонецЕсли;
	//крохин конец 02.04.2012
	
	Движение.Подразделение	= Подразделение;
	Движение.СтатьяЗатрат   = Справочники.СтатьиЗатрат.НайтиПоКоду("223 230");
	//	Движение.СтатьяЗатрат	= СтатьяЗатрат;
	//	Движение.СубЗатрата     = СубЗатрата;
	Движение.Комментарий    = Комментарий;
	Движение.КапитальныеЗатраты = Ложь;
	
	Если НЕ ПризнакВозврата Тогда
		Движение.СуммаУпр		= СуммаДокумента;	
		
		Движение.СуммаДокумента	= СуммаДокумента;
	
	Иначе
		Движение.СуммаУпр		= -СуммаДокумента;	
		
		Движение.СуммаДокумента	= -СуммаДокумента;
			//крохин начало 12.04.2021
	//ПРТ по комиссионным складам делают затраты по себестоимости, а не цене продажи
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
	//	ОбщаяСебестоимость = ДвиженияПоОстаткамТМЦ.ОстаткиТМЦ.Итог("Сумма");
	ОбщаяСебестоимость = 0;
	Для Каждого СтрокаТЧ Из ДвиженияПоОстаткамТМЦ.ОстаткиТМЦ Цикл
		Если СтрокаТЧ.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			ОбщаяСебестоимость = ОбщаяСебестоимость - СтрокаТЧ.Сумма;
		Иначе
			ОбщаяСебестоимость = ОбщаяСебестоимость + СтрокаТЧ.Сумма;
		КонецЕсли;
		
	КонецЦикла;
		Движение.СуммаУпр		= ОбщаяСебестоимость;	
		
		Движение.СуммаДокумента	= ОбщаяСебестоимость;

	КонецЕсли;
	//крохин конец 12.04.2021

	КонецЕсли;
	
		
	Движение.ВалютаДокумента= ВалютаДокумента;	
	
	Движение.ДатаЗаписи		=ТекущаяДата();
	
	Если ОбменДанными.Загрузка Тогда
		Движения.Затраты.Записать();	
	КонецЕсли;	
	
	//Регистр СостоянияПретензий, для новых
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияПретензий.Документ,
	|	СостоянияПретензий.ДокОснование,
	|	СостоянияПретензий.СостояниеПретензии
	|ИЗ
	|	РегистрСведений.СостоянияПретензий КАК СостоянияПретензий
	|ГДЕ
	|	СостоянияПретензий.Документ = &Документ
	|	И СостоянияПретензий.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("Документ",Ссылка);
	запрос.УстановитьПараметр("ДокОснование",Ссылка.ДокОснование);
	Выборка = запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		НаборЗаписей = РегистрыСведений.СостоянияПретензий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.документ.Использование = Истина;
		НаборЗаписей.Отбор.документ.Значение = Ссылка;
		НаборЗаписей.Отбор.ДокОснование.Использование = Истина;
		НаборЗаписей.Отбор.ДокОснование.Значение = Ссылка.ДокОснование;
		Запись = НаборЗаписей.Добавить();
		Запись.Документ = Ссылка;
		Запись.ДокОснование = Ссылка.ДокОснование;
		Запись.СостояниеПретензии =Перечисления.СостояниеПретензии.Оформлена;
		НаборЗаписей.Записать();
	КонецЕсли;
	
	//крохин начало 12.04.2021
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение И ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
			ДвиженияПоОстаткамТМЦКомиссия = Неопределено;
			РезультатПроведения = ПроведениеПоРегиструОстаткиТМЦКомиссия(Ссылка,ДвиженияПоОстаткамТМЦКомиссия);
			ВыполнитьДвиженияПоРегистрам(ДвиженияПоОстаткамТМЦКомиссия, Истина);
	КонецЕсли;
   //крохин конец 12.04.2021

	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;	
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	//крохин начало 19.12.2011
	//проверка на существование претензий
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Претензия.Ссылка
	|ИЗ
	|	Документ.Претензия КАК Претензия
	|ГДЕ
	|	Претензия.Проведен
	|	И Претензия.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("ДокОснование",Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		#Если Клиент Тогда
			Сообщить("По этому документу уже существует претензия. Открыт существующий документ");
			ФормаПретензии = Выборка.Ссылка.ПолучитьФорму("ФормаДокумента");
			ФормаПретензии.Открыть();
		#КонецЕсли
		Возврат;
	КонецЦикла;
	//крохин конец 19.12.2011
	
	//крохин начало 10.04.2012
	//проверка на корректность заполнения, для ПНК
	Если Основание.Метаданные().Имя = "ПриходнаяНакладная" Тогда
		//нулевые цены
		Для Каждого СтрокаТЧ Из Основание.Товары Цикл
			Если СтрокаТЧ.Количество > 0 И СтрокаТЧ.Цена = 0 Тогда
				Сообщить("пустые цены на закладке ""товары"", создание претензии невозможно");
				Возврат;
			КонецЕсли;
			
			//нечаева 29,07,014 +++
			Если СтрокаТЧ.Количество <> 0 И СтрокаТЧ.Цена <> 0 И СтрокаТЧ.Всего = 0 Тогда
				Сообщить("Не верный пересчет сумм на закладке ""товары"", создание претензии невозможно");
				Возврат;
			КонецЕсли;
			//нечаева 29,07,014 ---
			
			
		КонецЦикла;
		//соответствие товаров и заказа
		Если Основание.Товары.Итог("всего") <> Основание.Заказ.Итог("ВсегоФакт") Тогда
			Сообщить("не совпадают суммы на закладках ""товары"" и ""документ клиента"", создание претензии невозможно");
			Возврат;	
		КонецЕсли;
		Если Основание.Товары.Итог("Количество") <> Основание.Заказ.Итог("КоличествоФакт") Тогда
			Сообщить("не совпадает количество на закладках ""товары"" и ""документ клиента"", создание претензии невозможно");
			Возврат;	
		КонецЕсли;
		//нулевые цены контрагента
		Для Каждого СтрокаТЧ Из Основание.Заказ Цикл
			Если СтрокаТЧ.Количество > 0 И СтрокаТЧ.Цена = 0 Тогда
				Сообщить("пустые цены на закладке ""документ клиента"", создание претензии невозможно");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//крохин конец 10.04.2012
	
	
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ДокОснование	= Основание;
	
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");			
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
	//Подразделение   = Контрагент.Менеджер.Подразделение;
	
	//крохин начало 04.05.2021
	//дата не нужна, она меняется в ПНК
	//Комментарий		= "ПРТ к "+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");	
	Комментарий		= "ПРТ к "+ДокОснование.Метаданные()+" № " + ДокОснование.Номер;
	//крохин конец 04.05.2021
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" Тогда
		Контрагент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		Договор     = ДокОснование.Договор;
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Контрагент	= ДокОснование.СкладПолучатель;
		Склад			= ДокОснование.Склад;
	Иначе
		Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");		
	КонецЕсли;	
	
	Подразделение   = Контрагент.Менеджер.Подразделение;
	
	//крохин начало 10.12.2020
	//Если ВидОснования="ПриходнаяНакладная" И ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
	Если ВидОснования="ПриходнаяНакладная" И (ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя ИЛИ ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.Комиссия)Тогда
	//крохин конец 10.12.2020	
		
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Заказ Цикл
			Если ИсхСтрокаТЧ.Количество<>ИсхСтрокаТЧ.КоличествоФакт ИЛИ ИсхСтрокаТЧ.Всего<>ИсхСтрокаТЧ.ВсегоФакт Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.КоличествоИсх	=ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.КоличествоФакт	=ИсхСтрокаТЧ.КоличествоФакт;
				СтрокаТЧ.Количество		=СтрокаТЧ.КоличествоФакт-СтрокаТЧ.КоличествоИсх;
				СтрокаТЧ.ЦенаИсх	=ИсхСтрокаТЧ.Цена; 
				СтрокаТЧ.ЦенаФакт	=ИсхСтрокаТЧ.ЦенаФакт;
				//нечаева 07,07,14++
				СтрокаТЧ.СтавкаНДС	=ПолучитьСтавкуНДС(ИсхСтрокаТЧ.Номенклатура);
				СтрокаТЧ.Коэффициент	=ИсхСтрокаТЧ.Коэффициент;
                //нечаева 07,07,14*--
                               
				//крохин начало 16.03.2012
				//СтрокаТЧ.ВсегоИсх   =ИсхСтрокаТЧ.Цена*ИсхСтрокаТЧ.Количество;
				СтрокаТЧ.ВсегоИсх   =ИсхСтрокаТЧ.Всего; 
				//крохин конец 16.03.2012
				СтрокаТЧ.ВсегоФакт  =ИсхСтрокаТЧ.ВсегоФакт;
				СтрокаТЧ.Всего      =СтрокаТЧ.ВсегоФакт - СтрокаТЧ.ВсегоИсх; 
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект,"ОтВсего");
			КонецЕсли; 			
		КонецЦикла;
	ИначеЕсли ВидОснования="РасходнаяНакладная" Тогда
		//крохин начало 07.06.2012
		//подразделение в ПРТ - из документа, аналогично СПН
		Подразделение = ДокОснование.Подразделение;
		//крохин конец 07.06.2012
		
		//рекламации
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РекламационнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РекламационнаяНакладная КАК РекламационнаяНакладная
		|ГДЕ
		|	РекламационнаяНакладная.ДокОснование = &ДокОснование
		//крохин начало 24.04.2012
		//только вычерки, к РНК может быть и вычерк, и претензия
		//крохин начало 25.05.2012
		//какая-то ошибка, видимо
		// |	И НЕ РекламационнаяНакладная.ВидРекламации = &ВидРекламации
		//крохин конец 25.05.2012
		//крохин конец 24.04.2012
		|	И НЕ РекламационнаяНакладная.ПометкаУдаления ";
		Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		//крохин начало 24.04.2012
		//только вычерки, к РНК может быть и вычерк, и претензия
		запрос.УстановитьПараметр("ВидРекламации",Перечисления.ВидыРекламаций.Вычерк);
		//крохин конец 24.04.2012
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Для Каждого ИсхСтрокаТЧ ИЗ Выборка.Ссылка.Товары Цикл
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ);
				//крохин начало 24.04.2012	
				//скидка в РКМ отсутствует, пересчет даст неверный итог
				//		РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
				//крохин конец 24.04.2012
				СтрокаТЧ.ЦенаИсх	=ИсхСтрокаТЧ.Цена; 
				СтрокаТЧ.ЦенаФакт	=ИсхСтрокаТЧ.Цена;
				СтрокаТЧ.ВсегоИсх   =ИсхСтрокаТЧ.Цена*ИсхСтрокаТЧ.КоличествоИсх;
				СтрокаТЧ.ВсегоФакт  =ИсхСтрокаТЧ.Цена*ИсхСтрокаТЧ.КоличествоФакт;
				
			КонецЦикла;
		КонецЦикла;
		
		
		
	КонецЕсли;
	
	//крохин начало 29.03.2012			 
	//договор
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Договоры.Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.КодЦБ = &КодЦБ
	|	И Договоры.ВидДоговора_Новый = &ВидДоговора";
	
	Запрос.УстановитьПараметр("КодЦБ",ДокОснование.Контрагент.КодЦБ);
	Запрос.УстановитьПараметр("ВидДоговора",Справочники.ВидыДоговоров.НайтиПоКоду("000001019"));
	Выборка = запрос.Выполнить().Выбрать();
	//	ДоговорПретензия = Неопределено;
	Если НЕ Выборка.Следующий() Тогда
		ДоговорПретензия = Справочники.Договоры.СоздатьЭлемент();
		ДоговорПретензия.ВидДоговора = Перечисления.ВидыДоговоров.Товары;
		ДоговорПретензия.ВидДоговора_Новый = Справочники.ВидыДоговоров.НайтиПоКоду("000001019");
		ДоговорПретензия.Владелец = Контрагент;
		ДоговорПретензия.Дата = ТекущаяДата();
		ДоговорПретензия.КодЦБ = Контрагент.КодЦБ;
		ДоговорПретензия.Наименование = "Претензия";
		ДоговорПретензия.Номер = "Претензия";
		ДоговорПретензия.Организация = ДокОснование.Организация;
		ДоговорПретензия.Подразделение = ДокОснование.Договор.Подразделение;
		ДоговорПретензия.ВалютаКредита = Справочники.Валюты.НайтиПоКоду("810");
		ДоговорПретензия.УсловияОплаты =  Перечисления.УсловияОплаты.Предоплата;
		ДоговорПретензия.Записать();
	Иначе
		ДоговорПретензия = Выборка.Ссылка;
	КонецЕсли;
	Договор = ДоговорПретензия.ссылка;
	//крохин конец 29.03.2012
	
	//крохин начало 24.05.2012
	ДатаОплаты = ДокОснование.ДатаОплаты;
	//крохин конец 24.05.2012
	
	
КонецПроцедуры

Функция ПолучитьСостояниеПретензии(Док)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияПретензий.Документ,
	|	СостоянияПретензий.ДокОснование,
	|	СостоянияПретензий.СостояниеПретензии
	|ИЗ
	|	РегистрСведений.СостоянияПретензий КАК СостоянияПретензий
	|ГДЕ
	|	СостоянияПретензий.Документ = &Документ
	|	И СостоянияПретензий.ДокОснование = &ДокОснование";
	Запрос.УстановитьПараметр("Документ",Ссылка);
	запрос.УстановитьПараметр("ДокОснование",Ссылка.ДокОснование);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СостояниеПретензии;  
	Иначе
		Возврат Перечисления.СостояниеПретензии.Оформлена;  
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ПолучитьСостояниеПретензии(Ссылка) = Перечисления.СостояниеПретензии.Закрыта Тогда
			Если Не ПолучитьПолномочиеПользователя("ИзменениеОтработанныхПретензий") Тогда
				#Если Клиент Тогда
					Предупреждение("Отсутсвуют права на удаление отработанной претензии", 60);
					Отказ = Истина;
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
		если ДокОснование.СостояниеНакладной<>Перечисления.СостоянияНакладной.ГотоваКПриемке
			и ДокОснование.Метаданные().Имя="ПриходнаяНакладная" тогда
			Сообщить("Удаление претензии при данном состоянии накладной - запрещено! Поставьте ПНК в состояние Готова к приемке по складу возвратов и удалите претензию.");
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Шворобей ВЮ 10.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1158
	Если ЗначениеЗаполнено(ДокОснование) И ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") И
		ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Если Дата >= ДокОснование.Дата Тогда
			Дата = ?(ДокОснование.Дата <> НачалоДня(ДокОснование.Дата), ДокОснование.Дата - 1, ДокОснование.Дата);
		КонецЕсли;
	КонецЕсли;
	// Шворобей ВЮ 10.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1158
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

// Шворобей ВЮ 12.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701
НужноВыгружать = Ложь;
// Шворобей ВЮ 12.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-701
